<hr>
<h1><center>Index, joining and merging, filter, and grouping</center></h1>
<hr>

In [59]:
import pandas as pd
import numpy as np

# Index

In [60]:
np.random.seed(6) 


boxes = {'id': np.arange(5),
         'X': np.random.randint(10,20,5),
         'Y': np.random.randint(40,100,5),
         'Z': np.random.randint(0,10,5)}

In [61]:
df = pd.DataFrame(boxes)

In [62]:
df

   id   X   Y  Z
0   0  19  41  1
1   1  13  51  4
2   2  14  53  1
3   3  10  97  8
4   4  19  66  2

In [63]:
df = df.set_index('id')
df

     X   Y  Z
id
0   19  41  1
1   13  51  4
2   14  53  1
3   10  97  8
4   19  66  2

# Joining and merging

# Filter

# Grouping

In [77]:
np.random.seed(6) 


boxes1 = {'A': np.random.randint(10,20,5),
         'B': np.random.randint(40,100,5),
         'C': np.random.randint(0,10,5)}

np.random.seed(10) 


boxes2 = {'A': np.random.randint(10,20,5),
         'B': np.random.randint(40,100,5),
         'C': np.random.randint(0,10,5)}

In [78]:
df1 = pd.DataFrame(boxes1)
df2 = pd.DataFrame(boxes2)

In [79]:
df1

    A   B  C
0  19  41  1
1  13  51  4
2  14  53  1
3  10  97  8
4  19  66  2

In [80]:
df2

    A   B  C
0  19  69  8
1  14  88  9
2  10  69  0
3  11  89  8
4  19  98  6

In [81]:
pd.concat([df1,df2]).reset_index(drop=True)

    A   B  C
0  19  41  1
1  13  51  4
2  14  53  1
3  10  97  8
4  19  66  2
5  19  69  8
6  14  88  9
7  10  69  0
8  11  89  8
9  19  98  6

In [82]:
pd.concat([df1,df2], axis=1)

    A   B  C   A   B  C
0  19  41  1  19  69  8
1  13  51  4  14  88  9
2  14  53  1  10  69  0
3  10  97  8  11  89  8
4  19  66  2  19  98  6

In [110]:
serie = pd.Series([12, 45, 205], index=['A', 'B', 'C'])
serie

A     12
B     45
C    205
dtype: int64

In [111]:
df1.append(serie, ignore_index =True)

C:\Users\Jaime12\AppData\Local\Temp\ipykernel_11996\2679376379.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(serie, ignore_index =True)

    A   B    C
0  19  41    1
1  13  51    4
2  14  53    1
3  10  97    8
4  19  66    2
5  12  45  205